FV2310/E_0470.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">GPKE</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">6.9.1: AD: Unterbrechung der Anschlussnutzung (Sperren) auf Anweisung des LF</FONT></B><BR/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_0470</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> NB</B></FONT><BR align="center"/>>];
    "1" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>1: </B>Ist die Marktlokation bereits gesperrt?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A01</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Marktlokation ist bereits gesperrt.<BR align="left"/></FONT>>];
    "2" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>2: </B>Liegt für die Marktlokation im Zeitraum von 6 WT ab dem frühestmöglichen<BR align="left"/>Sperrtermin bereits ein Sperrauftrag vor?<BR align="left"/>>];
    "A10" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A10</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Sperrauftrag für Marktlokation liegt bereits vor.<BR align="left"/></FONT>>];
    "3" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>3: </B>Ist im gesamten Ausführungszeitraum des Sperrauftrags (= frühestmöglicher<BR align="left"/>Sperrtermin bis frühestmöglicher Sperrtermin + 6 WT) der die Sperrung<BR align="left"/>beauftragende LF der zu sperrenden Marktlokation zugeordnet?<BR align="left"/>>];
    "A11" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A11</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Zukünftiger bestätigter Lieferbeginn liegt gegenüber anderem Lieferanten bereits vor.<BR align="left"/>Die Ausführungsfrist der 6 WT ab dem frühestmöglichen Sperrtermin berührt das<BR align="left"/>bestätigte Lieferbeginndatum gegenüber anderem Lieferanten.<BR align="left"/></FONT>>];
    "4" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>4: </B>Ist im Zeitraum von 6 WT ab dem frühestmöglichen Sperrtermin an allen<BR align="left"/>Messlokationen, welche der Marktlokation zugeordnet sind, der identische MSB<BR align="left"/>zugeordnet, wie an der zu sperrenden Marktlokation?<BR align="left"/>>];
    "A02" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A02</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>An mindestens einer Messlokation ist ein anderer MSB zugeordnet als an der Marktlokation.<BR align="left"/>Hinweis: Stromspezifische Frage<BR align="left"/></FONT>>];
    "5" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>5: </B>Liegt die zu sperrende Marktlokation in der Niederspannung?<BR align="left"/>>];
    "A03" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A03</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Marktlokation ist nicht in der Niederspannung.<BR align="left"/>Hinweis: Stromspezifische Frage<BR align="left"/></FONT>>];
    "6" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>6: </B>Sind weitere Marktlokationen von der Sperrung betroffen, für die dieser<BR align="left"/>Sperrauftrag keine Wirkung entfalten darf?<BR align="left"/>>];
    "A04" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A04</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Mindestens eine weitere Marktlokation ist von der Sperrung betroffen.<BR align="left"/></FONT>>];
    "7" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>7: </B>Liegt im gesamten Ausführungszeitraum ein bestätigter Lieferbeginn gegenüber<BR align="left"/>dem beauftragenden LF vor?<BR align="left"/>>];
    "A12" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A12</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Im Ausführungszeitraum liegt bereits ein bestätigter Lieferbeginn gegenüber dem<BR align="left"/>beauftragenden LF vor.<BR align="left"/></FONT>>];
    "8" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>8: </B>Liegt ein Verhinderungsgrund einer Sperrung an der Marktlokation vor?<BR align="left"/>>];
    "A05" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A05</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Verhinderungsgrund liegt vor.<BR align="left"/>Hinweis: Das identifizierte Problem ist in der<BR align="left"/> Antwort zu beschreiben/benennen.<BR align="left"/></FONT>>];
    "9" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>9: </B>Ist der Sperrauftrag termingebunden?<BR align="left"/>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>10: </B>Liegt der übermittelte Sperrtermin mindestens 12 WT nach dem Eingangsdatum der<BR align="left"/>Nachricht des Sperrauftrags?<BR align="left"/>>];
    "A06" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A06</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Fristverletzung bei einem termingebundenen Sperrauftrag.<BR align="left"/></FONT>>];
    "11" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>11: </B>Liegt der übermittelte frühestmögliche Sperrtermin mindestens 6 WT nach dem<BR align="left"/>Eingangsdatum der Nachricht des Sperrauftrags?<BR align="left"/>>];
    "A07" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A07</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Fristverletzung bei einem nicht termingebundenen Sperrauftrag.<BR align="left"/></FONT>>];
    "12" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>12: </B>Ist ein zuvor nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>];
    "A99" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A99</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Sonstiges<BR align="left"/>Hinweis: Das identifizierte Problem ist in der<BR align="left"/>Antwort zu beschreiben/benennen.<BR align="left"/>Nutzungsmöglichkeit Ende: 01.10.2024 00:00 Uhr<BR align="left"/></FONT>>];
    "13" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>13: </B>Kann der Sperrauftrag pauschal über das elektronische Preisblatt abgebildet werden?<BR align="left"/>>];
    "A08" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A08</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Sperrung wird über das elektronische Preisblatt abgebildet.<BR align="left"/></FONT>>];
    "A09" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A09</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Die individuellen Sperrkosten werden in der Nachricht ausgetauscht.<BR align="left"/></FONT>>];

    "Start" -> "1";
    "1" -> "A01" [label="Ja"];
    "1" -> "2" [label="Nein"];
    "2" -> "A10" [label="Ja"];
    "2" -> "3" [label="Nein"];
    "3" -> "A11" [label="Nein"];
    "3" -> "4" [label="Ja"];
    "4" -> "A02" [label="Nein"];
    "4" -> "5" [label="Ja"];
    "5" -> "A03" [label="Nein"];
    "5" -> "6" [label="Ja"];
    "6" -> "A04" [label="Ja"];
    "6" -> "7" [label="Nein"];
    "7" -> "A12" [label="Ja"];
    "7" -> "8" [label="Nein"];
    "8" -> "A05" [label="Ja"];
    "8" -> "9" [label="Nein"];
    "9" -> "10" [label="Ja"];
    "9" -> "11" [label="Nein"];
    "10" -> "A06" [label="Nein"];
    "10" -> "12" [label="Ja"];
    "11" -> "A07" [label="Nein"];
    "11" -> "12" [label="Ja"];
    "12" -> "A99" [label="Ja"];
    "12" -> "13" [label="Nein"];
    "13" -> "A08" [label="Ja"];
    "13" -> "A09" [label="Nein"];

    bgcolor="transparent";
}
